idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
/****************************************Copyright (c)****************************************************
 **                                  		 广州星海科技
 **                                  http://simhi.taobao.com
 **																		 TEL:15018750559
 **																			 QQ:86817447
 **------------------------File Info----------------------------------------------------------------------
 ** File Name:             GSM_App.c
 ** Last modified Date:   	2012.5.15
 ** Last Version:          V1.0
 ** Description:           GPS管理解析
 **
 **--------------------------------------------------------------------------------------------------------
 ** Created By:            Chenht
 ** Created date:          2012-5-3
 ** Version:               v1.0
 ** Descriptions:          The original version 初始版本
 **
 **--------------------------------------------------------------------------------------------------------
 ** Modified by:
 ** Modified date:
 ** Version:
 ** Description:
 **
 *********************************************************************************************************/

#include "string.h"
#include "stdio.h"
#include "stdlib.h"

#include "stm32gps_config.h"
#include "stm32_eval.h"
#include "usart.h"
#include "at_command.h"
#include "string_operator.h"
#include "global_utilities.h"
#include "GSM_App.h"


static char BackBuf[USART_GSM_BUFSIZE];
static char sendBuf[USART_GSM_BUFSIZE_SEND];
static char receiveBuf[USART_GSM_BUFSIZE_RECEIVE];

pST_GSMCMD pGSM_msg;
extern volatile ST_RTCTIME CurSysTime;
unsigned char GSMNetType;

///////////////////////function declearation ///////////////////////
static void GSM_simcard_Init(void);
static unsigned char GSM_SendAT(char *pCMD, char *pCMDBack, uint32_t CMDLen);


/*********************************************************************************************************
 ** Function name:       GSM_RingPinInit()
 ** Descriptions:        Ring状态检测IO初始化
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:
 *********************************************************************************************************/
void GSM_RingPinInit(void)
{
#if 0
    GPIO_InitTypeDef GPIO_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource8);

    EXTI_InitStructure.EXTI_Line = EXTI_Line8;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
#endif
}

/*********************************************************************************************************
 ** Function name:       GSM_ChkRingSta()
 ** Descriptions:        检测Ring状态
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      Ring状态
 *********************************************************************************************************/
unsigned char GSM_ChkRingSta(void)
{
#if 0
    if (!GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_8))
    {
        return 1;
    }
#endif
    return 0;
}


/*********************************************************************************************************
 ** Function name:       GSM_PowerOnOff()
 ** Descriptions:        启动或关闭模块
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:
 *********************************************************************************************************/
void GSM_PowerOnOff(void)
{
    GPIO_ResetBits(GPIOC, GPIO_Pin_12);
    delay_ms(3000);
    GPIO_SetBits(GPIOC, GPIO_Pin_12);
    delay_ms(3000);
}

/** \brief 开启模块
 *
 * 通过拉低PWRKEY并保持至少1秒，然后释放，可以开启模块
 * 同样，通过拉低PWRKEY并保持至少1秒，然后释放，可以关闭模块
 *
 *  \param void
 *  \retval void
 */
void GSM_PowerOn(void)
{
	if(SET == GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_11))
	{
		printf("GPRS(SIM800L) have Turned On\n");
	}
	else
	{
		printf("GPRS(SIM800L) is Turning On...\n");
		GPIO_ResetBits(GPIOA, GPIO_Pin_12);
		delay_ms(2000);
		GPIO_SetBits(GPIOA, GPIO_Pin_12);;	
		delay_ms(5000);
	}
}

/** \brief 开启模块
 *
 * 通过拉低PWRKEY并保持至少1秒，然后释放，可以开启模块
 * 同样，通过拉低PWRKEY并保持至少1秒，然后释放，可以关闭模块
 *
 *  \param void
 *  \retval void
 */
void GSM_PowerOff(void)
{
	if(RESET == GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_11))
	{
		printf("GPRS(SIM800L) have Turned Off\n");
	}
	else
	{
		printf("GPRS(SIM800L) is Turning Off...\n");
		GPIO_ResetBits(GPIOA, GPIO_Pin_12);
		delay_ms(2000);
		GPIO_SetBits(GPIOA, GPIO_Pin_12);;	
		delay_ms(3000);
	}
}

/*********************************************************************************************************
 ** Function name:       GSM_ClearBuffer()
 ** Descriptions:        清空接收缓存
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:
 *********************************************************************************************************/
void GSM_ClearBuffer(void)
{
    memset(BackBuf, 0, USART_GSM_BUFSIZE);
}
/*********************************************************************************************************
 ** Function name:       GSM_SendAT()
 ** Descriptions:        发送一条AT指令
 ** input parameters:    pCMD：指令指针
 **                      pCMDBack： 指令返回参考指针
 **                      CMDLen:  指令长度
 ** output parameters:   NONE
 ** Returned value:      发送指令返回状态
 *********************************************************************************************************/
#define DBG_GSM_SendAT
static unsigned char GSM_SendAT(char *pCMD, char *pCMDBack, uint32_t CMDLen)
{
    unsigned char i = AT_RESEND_TIMES;
    unsigned int len;
    char *pBackBuf = BackBuf;
    unsigned char retFlag = 0;

    len = CMDLen;

#ifdef DBG_GSM_SendAT
    {
        uint32_t tmpIdx;

        if (len > 0)
        {
            printf("GSM_SendAT send\r\n");
            for (tmpIdx = 0; tmpIdx < len; tmpIdx ++)
            {
                //printf("%d-%c\r\n", tmpIdx, pBackBuf[tmpIdx]);
                printf("%c",pCMD[tmpIdx]);
            }
            printf("\r\n");
            printf("GSM_SendAT done\r\n");
        }
    }
#endif

    usart_sendbuffer(STM32_SIM908_GSM_COM, pCMD, (unsigned int *) &len);

