idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
}

void GPS_Init(void)
{
    uint32_t len;

    //打开GPS
    //可根据需要设置GPS输出数据选择 如AT+CGPSOUT=67
    len = sizeof(AT_CGPSPWR);
    while (USART_SUCESS != GSM_SendAT((char *) AT_CGPSPWR, (char *) "OK", len));
    len = sizeof(AT_CGPSRST);
    while (USART_SUCESS != GSM_SendAT((char *) AT_CGPSRST, (char *) "OK", len));
}

void GSM_Init(void)
{
    unsigned char i = 0;
    unsigned char len;

    GSM_RingPinInit();
//	GSM_PowerOnOff();											

    // AT握手
    len = sizeof(AT_Cmd) - 1;

    while (USART_SUCESS != GSM_SendAT((char *) AT_Cmd, (char *) AT_OK, len))
    {
        delay_ms(300);
        i++;
        if (i > 2)
        {
            GSM_PowerOnOff();
            i = 0;
        }
    }

    //关闭回显
    len = sizeof(ATE0_Cmd) - 1;
    GSM_SendAT((char *) ATE0_Cmd, (char *) AT_OK, sizeof(ATE0_Cmd));

    GSM_simcard_Init();
}
/*********************************************************************************************************
 ** Function name:       GSM_CallNumber
 ** Descriptions:        呼叫一个电话号码
 ** input parameters:    pNumber: 呼叫的电话号码指针
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_CallNumber(char *pNumber)
{
    static char *pcmdbuf = NULL;
    unsigned int cmdLen = 0;

    pcmdbuf = sendBuf;
    if (NULL == pcmdbuf)
    {
        return USART_FAIL;
    }
    sprintf(pcmdbuf, ATD_Cmd, pNumber);
    cmdLen = strlen(pcmdbuf);
    if (USART_SUCESS == GSM_SendAT((char *) pcmdbuf, (char *) AT_OK, cmdLen))
    {
        return USART_SUCESS;
    }

    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_ReadNumberFromSIM
 ** Descriptions:        SIM卡中读取一个电话号码
 ** input parameters:    No: SIM卡中电话号码位置
 ** output parameters:   pNumber: 读取到的电话号码
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_ReadNumberFromSIM(unsigned char No, ST_PHONEBOOKS *pNumber)
{
    static char *pcmdbuf = NULL;
    static char *pfeed_per = NULL, *pfeed_next = NULL;
    unsigned int cmdLen = 0;

    if (No == 0 || No > 250)
    {
        return USART_FAIL;
    }
    pcmdbuf = sendBuf;
    if (NULL == pcmdbuf)
    {
        return USART_FAIL;
    }
    sprintf(pcmdbuf, AT_CPBR, No);
    cmdLen = strlen(pcmdbuf);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT((char *) pcmdbuf, (char *) "+CPBR", cmdLen))
    {
        pfeed_per = strnchr(BackBuf, '"', 1);
        pfeed_next = strnchr(BackBuf, '"', 2);
        if ((NULL == pfeed_per) || (NULL == pfeed_next))
        {

            return USART_FAIL;
        }
        memcpy(&(pNumber->PhoneNumber), pfeed_per + 1,
                abs(pfeed_next - pfeed_per - 1));

        pfeed_per = strnchr(BackBuf, '"', 3);
        pfeed_next = strnchr(BackBuf, '"', 4);
        if ((NULL == pfeed_per) || (NULL == pfeed_next))
        {

            return USART_FAIL;
        }
        memcpy(&(pNumber->Name), pfeed_per + 1,
                abs(pfeed_next - pfeed_per - 1));

        return USART_SUCESS;
    }

    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_CallSIMNumber
 ** Descriptions:        呼叫SIM卡中的一个电话号码
 ** input parameters:    numberNo: SIM卡中电话号码位置
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_CallSIMNumber(unsigned char numberNo)
{
    static char *pcmdbuf = NULL;
    unsigned int cmdLen;

    if (numberNo > 250 || numberNo == 0)
    {
        return USART_FAIL;
    }
    pcmdbuf = sendBuf;
    if (NULL == pcmdbuf)
    {
        return USART_FAIL;
    }
    sprintf(pcmdbuf, ATD_n, numberNo);
    cmdLen = strlen(pcmdbuf);
    if (USART_SUCESS == GSM_SendAT(pcmdbuf, (char *) AT_OK, cmdLen))
    {

        return USART_SUCESS;
    }
    else
    {

        return USART_FAIL;
    }
}
/*********************************************************************************************************
 ** Function name:       GSM_QueryCallStatus
 ** Descriptions:        查询呼叫状态
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回呼叫状态
 *********************************************************************************************************/
unsigned char GSM_QueryCallStatus(void)
{
    unsigned int cmdLen;
    static char *pfeed = NULL;
    char status = AT_ACTIVE;

    cmdLen = strlen(AT_CLCC);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT((char *) AT_CLCC, (char *) AT_OK, cmdLen))
    {
        pfeed = strnchr(BackBuf, ',', 2);
        if (pfeed == NULL)
            return USART_FAIL;
        if (NULL != pfeed)
        {
            status = *(pfeed + 1);
            return status;
        }
    }
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_HangCall
 ** Descriptions:        挂断通话
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_HangCall(void)
{
    unsigned int cmdLen;

    cmdLen = strlen(ATH_Cmd);
    if (USART_SUCESS == GSM_SendAT((char *) ATH_Cmd, (char *) AT_OK, cmdLen))
    {
        return USART_SUCESS;
    }
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_AnswerCall
 ** Descriptions:        接听通话
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_AnswerCall(void)
{
    unsigned int cmdLen;

    cmdLen = strlen(ATA_Cmd);
    if (USART_SUCESS == GSM_SendAT((char *) ATA_Cmd, (char *) AT_OK, cmdLen))
    {
        return USART_SUCESS;
    }
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_GetRTCTime
 ** Descriptions:        查询RTC时钟时间
 ** input parameters:    NONE
 ** output parameters:   rtctime: 返回时间信息
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_GetRTCTime(pST_RTCTIME rtctime)
{
    unsigned int cmdLen;
    static char *pfeed = NULL;

    cmdLen = strlen(AT_CCLK);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT((char *) AT_CCLK, (char *) AT_OK, cmdLen))
    {
        pfeed = strnchr(BackBuf, ',', 1);
        if (pfeed == NULL)
            return USART_FAIL;
        pfeed -= 8;
        rtctime->Year = (pfeed[0] - 0x30) * 10 + (pfeed[1] - 0x30);
        rtctime->Month = (pfeed[3] - 0x30) * 10 + (pfeed[4] - 0x30);
        rtctime->Day = (pfeed[6] - 0x30) * 10 + (pfeed[7] - 0x30);
        rtctime->Hour = (pfeed[9] - 0x30) * 10 + (pfeed[10] - 0x30);
        rtctime->Min = (pfeed[12] - 0x30) * 10 + (pfeed[13] - 0x30);
        rtctime->Sec = (pfeed[15] - 0x30) * 10 + (pfeed[16] - 0x30);
        return USART_SUCESS;
    }
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_SetRTCTime
 ** Descriptions:        设置RTC时钟时间
 ** input parameters:    rtctime: 需要设置的时间信息
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_SetRTCTime(ST_RTCTIME rtctime)
{
    static char *pcmdbuf = NULL;
    unsigned int cmdLen = 0;

    GSM_ClearBuffer();
    pcmdbuf = sendBuf;
    if (pcmdbuf == NULL)
    {
        return USART_FAIL;
    }
    //格式化时间
    sprintf(pcmdbuf, AT_CCLKSet, (rtctime.Year) / 10, (rtctime.Year) % 10,
            (rtctime.Month) / 10, (rtctime.Month) % 10, (rtctime.Day) / 10,
            (rtctime.Day) % 10, (rtctime.Hour) / 10, (rtctime.Hour) % 10,
            (rtctime.Min) / 10, (rtctime.Min) % 10, (rtctime.Sec) / 10,
            (rtctime.Sec) % 10, (rtctime.Timezone) / 10,
            (rtctime.Timezone) % 10);
    cmdLen = strlen(pcmdbuf);
    if (USART_SUCESS == GSM_SendAT((char *) pcmdbuf, (char *) AT_OK, cmdLen))
    {

