idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
        return USART_SUCESS;
    }

    return USART_FAIL;
}

/*********************************************************************************************************
 ** Function name:       GSM_GetIMEI
 ** Descriptions:        查询IMEI
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_GetIMEI(pST_GSNIMEI imei)
{
    unsigned int cmdLen;
    //static char *pfeed = NULL;

    cmdLen = strlen(AT_GSN);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT((char *) AT_GSN, (char *) AT_OK, cmdLen))
    {
        strncpy(imei.IMEI, BackBuf, 15);
        return USART_SUCESS;
    }
    return USART_FAIL;
}

/*********************************************************************************************************
 ** Function name:       GPRS_Init
 ** Descriptions:      	GPRS初始化
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      NONE
 *********************************************************************************************************/
void GPRS_Init(void)
{
    unsigned int cmdLen;

    cmdLen = strlen(AT_CIPHEAD);
    GSM_SendAT((char *) AT_CIPHEAD, (char *) AT_OK, cmdLen);
    cmdLen = strlen(AT_CIPQSEND);
    GSM_SendAT((char *) AT_CIPQSEND, (char *) AT_OK, cmdLen);
    cmdLen = strlen(AT_CIPSPRT);
    GSM_SendAT((char *) AT_CIPSPRT, (char *) AT_OK, cmdLen);
    cmdLen = strlen(AT_CSTT);
    GSM_SendAT((char *) AT_CSTT, (char *) AT_OK, cmdLen);
    cmdLen = strlen(AT_CIICR);
    GSM_SendAT((char *) AT_CIICR, (char *) AT_OK, cmdLen);
    cmdLen = strlen(AT_CIPMODE);
    GSM_SendAT((char *) AT_CIPMODE, (char *) AT_OK, cmdLen);
}
/*********************************************************************************************************
 ** Function name:       GPRS_LinkServer
 ** Descriptions:      	建立一个链接
 ** input parameters:    pnetconfig: 网络配置信息
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
/*
 char RemoteIP[4];
 unsigned int RemotePort;
 char TransferMode[4];
 char APN[10];
 */
unsigned char GPRS_LinkServer(pST_NETWORKCONFIG pnetconfig)
{
    ST_NETWORKCONFIG netcfg = *pnetconfig;
    static char *pcmdbuf = NULL;
    unsigned int cmdLen = 0;

    pcmdbuf = sendBuf;
    if (pcmdbuf == NULL)
    {
        return USART_FAIL;
    }
    sprintf(pcmdbuf, AT_CIPSTART, netcfg.TransferMode, netcfg.RemoteIP,
            netcfg.RemotePort);
    cmdLen = strlen(pcmdbuf);
    if (USART_SUCESS == GSM_SendAT((char *) pcmdbuf, (char *) AT_OK, cmdLen))
    {
        return USART_SUCESS;
    }

    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GPRS_SendData
 ** Descriptions:      	GPRS非透传模式下发送数据
 ** input parameters:    pString: 需要发送的数据指针
 **											len:	需要发送的数据长度
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
#define DBG_GPRS_SendData
unsigned char GPRS_SendData(char *pString, unsigned int len)
{
	char *pBackBuf = BackBuf;
    unsigned int cmdLen;

    cmdLen = strlen(AT_CIPSEND);
    if (USART_SUCESS == GSM_SendAT((char *) AT_CIPSEND, (char *) '>', cmdLen))
    {
        cmdLen = sizeof(pString);
        usart_sendbuffer(STM32_SIM908_GSM_COM, pString, &len);
        cmdLen = 1;
        usart_sendbuffer(STM32_SIM908_GSM_COM, "\x1A", &cmdLen);
        //return USART_SUCESS;
    }

    {
        uint32_t i = 5;
        uint32_t len;
        unsigned char retFlag;

        while (--i)
        {
            len = USART_GSM_BUFSIZE;
            delay_ms(200);

            //printf("GSM_SendAT before usart_readbuffer len %d\n", len);

            retFlag =
                    usart_readbuffer(STM32_SIM908_GSM_COM, BackBuf, &len);
            //printf("GSM_SendAT after usart_readbuffer len %d\n", len);

#ifdef DBG_GPRS_SendData
            {
                uint32_t tmpIdx;
				uint32_t tmpStart;

                if (len > 0 && retFlag == USART_ENPROCESS)
                {
                    printf("GPRS_SendData recv\r\n");
                    for (tmpIdx = 0; tmpIdx < len; tmpIdx ++)
                    {
                        //printf("%d-%c\r\n", tmpIdx, pBackBuf[tmpIdx]);
                        printf("%c",BackBuf[tmpIdx]);
						
                    }
                    printf("\r\n");
                    printf("GPRS_SendData done\r\n");
                }
            }
			printf("%d retFlag = %d len = %d\n\n", i, retFlag, len);

			if (len > 0 && retFlag == USART_ENPROCESS)
            {
                if (NULL != strstr_len(pBackBuf, pString, len))
                {
                    break;
                }
            }
#endif
        }
        if (i == 0)
        {
            return USART_FAIL;
        }
    }
    return USART_SUCESS;
}
/*********************************************************************************************************
 ** Function name:       GPRS_ReceiveData
 ** Descriptions:      	GPRS接收数据,SIM908直接串口接收,不需要发送指令读取
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
#define DBG_GPRS_ReceiveData
unsigned char GPRS_ReceiveData(char *pString)
{
	uint32_t i = 5;
    uint32_t len;
    unsigned char retFlag;
	char *pReceiveBuf = receiveBuf;
	
    while (--i)
    {
        len = USART_GSM_BUFSIZE_RECEIVE;
        delay_ms(200);

        //printf("GSM_SendAT before usart_readbuffer len %d\n", len);

        retFlag =
                usart_readbuffer(STM32_SIM908_GSM_COM, receiveBuf, &len);
        //printf("GSM_SendAT after usart_readbuffer len %d\n", len);

#ifdef DBG_GPRS_ReceiveData
        {
            uint32_t tmpIdx;
			uint32_t tmpStart;

